mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1a1xb/s6e1a1xb.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- ******************************************************************************** -->
<!-- Copyright (C) 2013-2016, Cypress Semiconductor Corporation or a                  -->
<!-- subsidiary of Cypress Semiconductor Corporation.  All rights reserved.           -->
<!--                                                                                  -->
<!-- This software, including source code, documentation and related                  -->
<!-- materials ("Software"), is owned by Cypress Semiconductor Corporation or         -->
<!-- one of its subsidiaries ("Cypress") and is protected by and subject to           -->
<!-- worldwide patent protection (United States and foreign), United States           -->
<!-- copyright laws and international treaty provisions. Therefore, you may use       -->
<!-- this Software only as provided in the license agreement accompanying the         -->
<!-- software package from which you obtained this Software ("EULA").                 -->
<!--                                                                                  -->
<!-- If no EULA applies, Cypress hereby grants you a personal, non-exclusive,         -->
<!-- non-transferable license to copy, modify, and compile the                        -->
<!-- Software source code solely for use in connection with Cypress's                 -->
<!-- integrated circuit products.  Any reproduction, modification, translation,       -->
<!-- compilation, or representation of this Software except as specified              -->
<!-- above is prohibited without the express written permission of Cypress.           -->
<!--                                                                                  -->
<!-- Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO                             -->
<!-- WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING,                             -->
<!-- BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED                                     -->
<!-- WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A                                  -->
<!-- PARTICULAR PURPOSE. Cypress reserves the right to make                           -->
<!-- changes to the Software without notice. Cypress does not assume any              -->
<!-- liability arising out of the application or use of the Software or any           -->
<!-- product or circuit described in the Software. Cypress does not                   -->
<!-- authorize its products for use in any products where a malfunction or            -->
<!-- failure of the Cypress product may reasonably be expected to result in           -->
<!-- significant property damage, injury or death ("High Risk Product"). By           -->
<!-- including Cypress's product in a High Risk Product, the manufacturer             -->
<!-- of such system or application assumes all risk of such use and in doing          -->
<!-- so agrees to indemnify Cypress against all liability.                            -->
<!-- ******************************************************************************** -->
<!-- 2016.05.30 10:18:49 generated by svdgen_v03i -->
<device schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Cypress</vendor>
  <name>S6E1A1xB</name>
  <version>2.1</version>
  <description>S6E1A1 Series package B</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000000</resetMask>
  <cpu>
    <name>CM0PLUS</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <fpuDP>false</fpuDP>
    <icachePresent>false</icachePresent>
    <dcachePresent>false</dcachePresent>
    <itcmPresent>false</itcmPresent>
    <dtcmPresent>false</dtcmPresent>
    <vtorPresent>false</vtorPresent>
    <nvicPrioBits>2</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <vendorExtensions>
    <mcutype>1</mcutype>
  </vendorExtensions>
  <peripherals>
    <!-- PERIPHERAL "FLASH_IF" -->
    <peripheral>
      <name>FLASH_IF</name>
      <description>Flash Memory</description>
      <version>A</version>
      <groupName>FLASH_IF</groupName>
      <baseAddress>0x40000000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "BT0_3_FLASHIF" -->
      <interrupt>
        <name>BT0_3_FLASHIF</name>
        <value>31</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "FRWTR" -->
        <register>
          <name>FRWTR</name>
          <description>Flash Read Wait Register [BHW]</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RWT" -->
            <field>
              <name>RWT</name>
              <description>Read Wait Cycle</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FSTR" -->
        <register>
          <name>FSTR</name>
          <description>Flash Status Register [BHW]</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PGMS" -->
            <field>
              <name>PGMS</name>
              <description>Flash Program Status</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SERS" -->
            <field>
              <name>SERS</name>
              <description>Flash Sector Erase Status</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ESPS" -->
            <field>
              <name>ESPS</name>
              <description>Flash Erase Suspend Status</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CERS" -->
            <field>
              <name>CERS</name>
              <description>Flash Chip Erase Status</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "HNG" -->
            <field>
              <name>HNG</name>
              <description>Flash Hang Status</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDY" -->
            <field>
              <name>RDY</name>
              <description>Flash Ready Status</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FSYNDN" -->
        <register>
          <name>FSYNDN</name>
          <description>Flash Sync Down Register [BHW]</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SD" -->
            <field>
              <name>SD</name>
              <description>Sync Down</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
