mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1a1xb/s6e1a1xb.svd
        <!-- REGISTER "IRQCMODE" -->
        <register>
          <name>IRQCMODE</name>
          <description>Interrupt Factor Vector Relocate Setting Register [BHW]</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IRQCMODE" -->
            <field>
              <name>IRQCMODE</name>
              <description>Select an interrupt factor vector. See periheral manual for details</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EXC02MON" -->
        <register>
          <name>EXC02MON</name>
          <description>EXC02 Batch Read Register [BHW]</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HWINT" -->
            <field>
              <name>HWINT</name>
              <description>Hardware watchdog timer interrupt request</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NMI" -->
            <field>
              <name>NMI</name>
              <description>NMIX external pin interrupt request</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ00MON" -->
        <register>
          <name>IRQ00MON</name>
          <description>IRQ00 Batch Read Register [BHW]</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSINT" -->
            <field>
              <name>FCSINT</name>
              <description>Anomalous frequency detection by CSV interrupt request</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ01MON" -->
        <register>
          <name>IRQ01MON</name>
          <description>IRQ01 Batch Read Register [BHW]</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SWWDTINT" -->
            <field>
              <name>SWWDTINT</name>
              <description>Software watchdog timer interrupt request</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ02MON" -->
        <register>
          <name>IRQ02MON</name>
          <description>IRQ02 Batch Read Register [BHW]</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDINT" -->
            <field>
              <name>LVDINT</name>
              <description>Low voltage detection (LVD) interrupt request</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ03MON" -->
        <register>
          <name>IRQ03MON</name>
          <description>IRQ03 Batch Read Register [BHW]</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WAVE2INT" -->
            <field>
              <name>WAVE2INT</name>
              <description>WFG timer 54 interrupt request in MFT unit 2</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVE1INT" -->
            <field>
              <name>WAVE1INT</name>
              <description>WFG timer 54 interrupt request in MFT unit 1</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVE0INT" -->
            <field>
              <name>WAVE0INT</name>
              <description>DTIF (motor emergency stop) interrupt request in MFT unit 0</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ04MON" -->
        <register>
          <name>IRQ04MON</name>
          <description>IRQ04 Batch Read Register [BHW]</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT7" -->
            <field>
              <name>EXTINT7</name>
              <description>Interrupt request of external interrupt ch.7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT6" -->
            <field>
              <name>EXTINT6</name>
              <description>Interrupt request of external interrupt ch.6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT5" -->
            <field>
              <name>EXTINT5</name>
              <description>Interrupt request of external interrupt ch.5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT4" -->
            <field>
              <name>EXTINT4</name>
              <description>Interrupt request of external interrupt ch.4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT3" -->
            <field>
              <name>EXTINT3</name>
              <description>Interrupt request of external interrupt ch.3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT2" -->
            <field>
              <name>EXTINT2</name>
              <description>Interrupt request of external interrupt ch.2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT1" -->
            <field>
              <name>EXTINT1</name>
              <description>Interrupt request of external interrupt ch.1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT0" -->
            <field>
              <name>EXTINT0</name>
              <description>Interrupt request of external interrupt ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ05MON" -->
        <register>
          <name>IRQ05MON</name>
          <description>IRQ05 Batch Read Register [BHW]</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT31" -->
            <field>
              <name>EXTINT31</name>
              <description>Interrupt request of external interrupt ch.31</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT30" -->
            <field>
              <name>EXTINT30</name>
              <description>Interrupt request of external interrupt ch.30</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT29" -->
            <field>
              <name>EXTINT29</name>
              <description>Interrupt request of external interrupt ch.29</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT28" -->
            <field>
              <name>EXTINT28</name>
              <description>Interrupt request of external interrupt ch.28</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT27" -->
            <field>
              <name>EXTINT27</name>
              <description>Interrupt request of external interrupt ch.27</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT26" -->
            <field>
              <name>EXTINT26</name>
              <description>Interrupt request of external interrupt ch.26</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT25" -->
            <field>
              <name>EXTINT25</name>
              <description>Interrupt request of external interrupt ch.25</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT24" -->
            <field>
              <name>EXTINT24</name>
              <description>Interrupt request of external interrupt ch.24</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT23" -->
            <field>
              <name>EXTINT23</name>
              <description>Interrupt request of external interrupt ch.23</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT22" -->
            <field>
              <name>EXTINT22</name>
              <description>Interrupt request of external interrupt ch.22</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT21" -->
            <field>
              <name>EXTINT21</name>
              <description>Interrupt request of external interrupt ch.21</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT20" -->
            <field>
              <name>EXTINT20</name>
              <description>Interrupt request of external interrupt ch.20</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT19" -->
            <field>
              <name>EXTINT19</name>
              <description>Interrupt request of external interrupt ch.19</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT18" -->
            <field>
              <name>EXTINT18</name>
              <description>Interrupt request of external interrupt ch.18</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT17" -->
            <field>
              <name>EXTINT17</name>
              <description>Interrupt request of external interrupt ch.17</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT16" -->
            <field>
              <name>EXTINT16</name>
              <description>Interrupt request of external interrupt ch.16</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT15" -->
            <field>
              <name>EXTINT15</name>
              <description>Interrupt request of external interrupt ch.15</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT14" -->
            <field>
              <name>EXTINT14</name>
              <description>Interrupt request of external interrupt ch.14</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT13" -->
            <field>
              <name>EXTINT13</name>
              <description>Interrupt request of external interrupt ch.13</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT12" -->
            <field>
              <name>EXTINT12</name>
              <description>Interrupt request of external interrupt ch.12</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT11" -->
            <field>
              <name>EXTINT11</name>
              <description>Interrupt request of external interrupt ch.11</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT10" -->
            <field>
              <name>EXTINT10</name>
              <description>Interrupt request of external interrupt ch.10</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT9" -->
            <field>
              <name>EXTINT9</name>
              <description>Interrupt request of external interrupt ch.9</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT8" -->
            <field>
              <name>EXTINT8</name>
              <description>Interrupt request of external interrupt ch.8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ06MON" -->
        <register>
          <name>IRQ06MON</name>
          <description>IRQ06 Batch Read Register [BHW]</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QUD2INT" -->
            <field>
              <name>QUD2INT</name>
              <description>Interrupt requests of the QPRC ch.2</description>
              <msb>19</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD1INT" -->
            <field>
              <name>QUD1INT</name>
              <description>Interrupt requests of the QPRC ch.1</description>
              <msb>13</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD0INT" -->
            <field>
              <name>QUD0INT</name>
              <description>Interrupt requests of the QPRC ch.0</description>
              <msb>7</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TIMINT" -->
            <field>
              <name>TIMINT</name>
              <description>Dual timer interrupt request</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
