mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1a1xb/s6e1a1xb.svd
        <!-- REGISTER "IRQ07MON" -->
        <register>
          <name>IRQ07MON</name>
          <description>IRQ07 Batch Read Register [BHW]</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Reception interrupt requests of MFS ch 0/8</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ08MON" -->
        <register>
          <name>IRQ08MON</name>
          <description>IRQ08 Batch Read Register [BHW]</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Status/Transmission interrupt requests of MFS ch 0/8</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ09MON" -->
        <register>
          <name>IRQ09MON</name>
          <description>IRQ09 Batch Read Register [BHW]</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Reception interrupt requests of MFS ch 1/9</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ10MON" -->
        <register>
          <name>IRQ10MON</name>
          <description>IRQ10 Batch Read Register [BHW]</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Status/Transmission interrupt requests of MFS ch 1/9</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ11MON" -->
        <register>
          <name>IRQ11MON</name>
          <description>IRQ11 Batch Read Register [BHW]</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Reception interrupt requests of MFS ch 2/10</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ12MON" -->
        <register>
          <name>IRQ12MON</name>
          <description>IRQ12 Batch Read Register [BHW]</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Status/Transmission interrupt requests of MFS ch 2/10</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ13MON" -->
        <register>
          <name>IRQ13MON</name>
          <description>IRQ13 Batch Read Register [BHW]</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Reception interrupt requests of MFS ch 3/11</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ14MON" -->
        <register>
          <name>IRQ14MON</name>
          <description>IRQ14 Batch Read Register [BHW]</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Status/Transmission interrupt requests of MFS ch 3/11</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
