mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1a1xb/s6e1a1xb.svd
        <!-- REGISTER "FPOER6" -->
        <register>
          <name>FPOER6</name>
          <description>Fast GPIO Output Enable Register 6 [BHW]</description>
          <addressOffset>0x918</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of FPOER6</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of FPOER6</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPOER7" -->
        <register>
          <name>FPOER7</name>
          <description>Fast GPIO Output Enable Register 7 [BHW]</description>
          <addressOffset>0x91C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "FPOER8" -->
        <register>
          <name>FPOER8</name>
          <description>Fast GPIO Output Enable Register 8 [BHW]</description>
          <addressOffset>0x920</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "FPOER9" -->
        <register>
          <name>FPOER9</name>
          <description>Fast GPIO Output Enable Register 9 [BHW]</description>
          <addressOffset>0x924</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "FPOERA" -->
        <register>
          <name>FPOERA</name>
          <description>Fast GPIO Output Enable Register A [BHW]</description>
          <addressOffset>0x928</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "FPOERB" -->
        <register>
          <name>FPOERB</name>
          <description>Fast GPIO Output Enable Register B [BHW]</description>
          <addressOffset>0x92C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "FPOERC" -->
        <register>
          <name>FPOERC</name>
          <description>Fast GPIO Output Enable Register C [BHW]</description>
          <addressOffset>0x930</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "FPOERD" -->
        <register>
          <name>FPOERD</name>
          <description>Fast GPIO Output Enable Register D [BHW]</description>
          <addressOffset>0x934</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "FPOERE" -->
        <register>
          <name>FPOERE</name>
          <description>Fast GPIO Output Enable Register E [BHW]</description>
          <addressOffset>0x938</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000D</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of FPOERE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of FPOERE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of FPOERE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FPOERF" -->
        <register>
          <name>FPOERF</name>
          <description>Fast GPIO Output Enable Register F [BHW]</description>
          <addressOffset>0x93C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "LVD" -->
    <peripheral>
      <name>LVD</name>
      <description>Low-voltage Detection</description>
      <version>A</version>
      <groupName>LVD</groupName>
      <baseAddress>0x40035000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "LVD" -->
      <interrupt>
        <name>LVD</name>
        <value>2</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "LVD_CTL" -->
        <register>
          <name>LVD_CTL</name>
          <description>Low-voltage Detection Voltage Control Register [BHW]</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x800C</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDRE" -->
            <field>
              <name>LVDRE</name>
              <description>Low-voltage detection reset operation enable bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SVHR" -->
            <field>
              <name>SVHR</name>
              <description>Low-voltage detection reset voltage setting bits</description>
              <msb>14</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LVDIE" -->
            <field>
              <name>LVDIE</name>
              <description>Low-voltage detection interrupt enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SVHI" -->
            <field>
              <name>SVHI</name>
              <description>Low-voltage detection interrupt voltage setting bits</description>
              <msb>6</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_STR" -->
        <register>
          <name>LVD_STR</name>
          <description>Low-voltage Detection Interrupt Factor Register [BHW]</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDIR" -->
            <field>
              <name>LVDIR</name>
              <description>Low-voltage detection interrupt factor bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_CLR" -->
        <register>
          <name>LVD_CLR</name>
          <description>Low-voltage Detection Interrupt Factor Clear Register [BHW]</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDCL" -->
            <field>
              <name>LVDCL</name>
              <description>Low-voltage detection interrupt factor clear bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
